Revit 2027 API
TextNode.Height Property
 Height [ft] of the area of the text content in model space.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Height { get; }
Public ReadOnly Property Height As Double
	Get
public:
property double Height {
	double get ();
}
member Height : float with get
Property Value
Double
See Also
Reference
TextNode Class
Autodesk.Revit.DB Namespace